---
type: PulldownButton
namespace: Autodesk.Revit.UI
version: 2024
members: 3
tags: [revit-api, class]
---

# PulldownButton

`Autodesk.Revit.UI.PulldownButton` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AddPushButton | — | `public PushButton AddPushButton ( PushButtonData buttonData )` |
| Method | AddSeparator | — | `public void AddSeparator ()` |
| Method | GetItems | — | `public IList < PushButton > GetItems ()` |